In [20]:
import pandas as pd
import numpy as np

In [21]:
d={'USN':[100,23,245],
   'NAME':['NIKI','HARSISHA','ASH'],
   'MOBLIE':[24,45,67],
   'MARKS':[88,99,56]
  }

In [22]:
std=pd.DataFrame(d)

In [23]:
std

   USN      NAME  MOBLIE  MARKS
0  100      NIKI      24     88
1   23  HARSISHA      45     99
2  245       ASH      67     56

In [24]:
std.head(2)
#displaying rows

   USN      NAME  MOBLIE  MARKS
0  100      NIKI      24     88
1   23  HARSISHA      45     99

In [25]:
std.info()
#gives all info about df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   NAME    3 non-null      object
 2   MOBLIE  3 non-null      int64
 3   MARKS   3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [26]:
std.columns
#displays columns

Index(['USN', 'NAME', 'MOBLIE', 'MARKS'], dtype='object')

In [27]:
std.isnull()

     USN   NAME  MOBLIE  MARKS
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [28]:
#access columns
std['USN']

0    100
1     23
2    245
Name: USN, dtype: int64

In [29]:
#acsess mutlple col
std[['USN','MARKS']]

   USN  MARKS
0  100     88
1   23     99
2  245     56

In [30]:
#access rows
std.loc[1]

USN             23
NAME      HARSISHA
MOBLIE          45
MARKS           99
Name: 1, dtype: object

In [31]:
#create a df cars having a attributes car id,car name,it should have 5 values
d={"car_id":[23456,7448,2345,7890,5627],
   "car_name":["swift","kiv","ford","BMW","mg"]}

In [32]:
df=pd.DataFrame(d)

In [33]:
df

   car_id car_name
0   23456    swift
1    7448      kiv
2    2345     ford
3    7890      BMW
4    5627       mg

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   car_id    5 non-null      int64
 1   car_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [35]:
f={"car_id":[23456,7448,2345,7890,5627,3456],
   "car_name":["swift","kiv","ford","BMW","MG",None]}

In [36]:
gh=pd.DataFrame(f)

In [37]:
gh

   car_id car_name
0   23456    swift
1    7448      kiv
2    2345     ford
3    7890      BMW
4    5627       MG
5    3456     None

In [38]:
gh.isnull()

   car_id  car_name
0   False     False
1   False     False
2   False     False
3   False     False
4   False     False
5   False      True

In [39]:
gh.loc[2]

car_id      2345
car_name    ford
Name: 2, dtype: object

In [40]:
gh.iloc[2]

car_id      2345
car_name    ford
Name: 2, dtype: object

In [41]:

gh.set_index('car_id')

       car_name
car_id
23456     swift
7448        kiv
2345       ford
7890        BMW
5627         MG
3456       None

In [42]:
#conditional selection
gh['car_id']<5600

0    False
1    False
2     True
3    False
4    False
5     True
Name: car_id, dtype: bool

In [43]:
newdf=gh['car_id']<5600

In [44]:
gh[newdf]['car_name']

2    ford
5    None
Name: car_name, dtype: object

In [45]:
gh[newdf]["car_id"]

2    2345
5    3456
Name: car_id, dtype: int64

In [46]:
d={'USN':[100,23,245],
   'NAME':['NIKI','HARSISHA','ASH'],
   'MOBLIE':[24,45,67],
   'MARKS':[88,99,"none"]
  }

In [47]:
jk=pandas.DataFrame(d)

In [48]:
jk

   USN      NAME  MOBLIE MARKS
0  100      NIKI      24    88
1   23  HARSISHA      45    99
2  245       ASH      67  none

In [55]:
import  pandas as pd

In [56]:
d={'USN':[100,23,245],
   'NAME':['NIKI','HARSISHA','ASH'],
   'MOBLIE':[24,45,67],
   'MARKS':[88,99,56]
  }

In [60]:
df=pd.DataFrame(d)

In [61]:
[(df['USN']>40)&(df['MARKS']>50)]

[0     True
 1    False
 2     True
 dtype: bool]

In [50]:
jk

   USN      NAME  MOBLIE MARKS
0  100      NIKI      24    88
1   23  HARSISHA      45    99
2  245       ASH      67  none

In [98]:
jk.dropna()

   USN      NAME  MOBLIE MARKS
0  100      NIKI      24    88
1   23  HARSISHA      45    99
2  245       ASH      67  none

In [99]:
f={"car_id":[23456,7448,2345,7890,5627,3456],
   "car_name":["swift","kiv","ford","BMW","MG",None]}

In [101]:
df=pd.DataFrame(f)

In [102]:
df

   car_id car_name
0   23456    swift
1    7448      kiv
2    2345     ford
3    7890      BMW
4    5627       MG
5    3456     None

In [103]:
df.dropna()

   car_id car_name
0   23456    swift
1    7448      kiv
2    2345     ford
3    7890      BMW
4    5627       MG

In [109]:
df.dropna(thresh=3)

Empty DataFrame
Columns: [car_id, car_name]
Index: []

In [3]:
import pandas

In [4]:
d={"car_id":[23456,7448,2345,7890,5627],
   "car_name":["swift","kiv","ford","BMW","mg"]}

In [5]:
df=pandas.DataFrame(d)

In [6]:
df.dropna(thresh=2)

   car_id car_name
0   23456    swift
1    7448      kiv
2    2345     ford
3    7890      BMW
4    5627       mg